
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 0 to change, 1 to destroy.</code></pre>

* Create
  * azurerm_storage_blob.b2c_config[&#34;20&#34;]
* Replace
  * azurerm_storage_blob.b2c_config[&#34;5&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_storage_blob.b2c_config["20"] will be created
  + resource "azurerm_storage_blob" "b2c_config" {
      + access_tier            = (known after apply)
      + content_md5            = "2d42ad7fca936af8072504a0c7c24f75"
      + content_type           = "application/octet-stream"
      + id                     = (known after apply)
      + metadata               = (known after apply)
      + name                   = "js/b2c.js"
      + parallelism            = 8
      + size                   = 0
      + source                 = "./b2c/views/js/b2c.js"
      + storage_account_name   = "presastg"
      + storage_container_name = "pre-b2c-container"
      + type                   = "Block"
      + url                    = (known after apply)
    }

  # azurerm_storage_blob.b2c_config["5"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_config" {
      ~ access_tier            = "Hot" -> (known after apply)
      ~ content_md5            = "59e1e195b2377b40e8a04a7261081512" -> "a5fb110836202d0037b470a3bb747962" # forces replacement
      ~ id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/template.html" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
        name                   = "template.html"
      ~ url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/template.html" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":753,"Program":"tfcmt","SHA1":"","Vars":{}} -->